CommunityGD32Cores/gigadevice-firmware-and-docs/GD32F1x0/GD32F1x0_Demo_Suites_V3.0.0/GD32150R_EVAL_Demo_Suites/Utilities/gd32f150r_audio_codec.c
        counter += codec_write_register(0x04, output_dev);

        /* exit the power save mode */
        counter += codec_write_register(0x02, 0x9E); 
    }

    return counter;
}

/*!
    \brief      stops audio codec playing. it powers down the codec
    \param[in]  codec_pdwn_mode:
      \arg        CODEC_PDWN_SW: only mutes the audio codec. when resuming from this 
                  mode the codec keeps the prvious initialization (no need to re-initialize
                  the codec registers)
      \arg        CODEC_PDWN_HW: physically power down the codec. when resuming from this
                  mode, the codec is set to default configuration (user should re-initialize
                  the codec in order to play again the audio stream)
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_stop(uint32_t codec_pdwn_mode)
{
    uint32_t counter = 0;

    /* mute the output first */
    codec_mute(AUDIO_MUTE_ON);

    if (codec_pdwn_mode == CODEC_PDWN_SW) {
        /* power down the dac and the speaker (pmdac and pmspk bits)*/
        counter += codec_write_register(0x02, 0x9F);
    } else {
        /* power down the dac components */
        counter += codec_write_register(0x02, 0x9F);

        /* wait at least 100ms */
        delay(0xFFF);
    }

    return counter;
}

/*!
    \brief      highers or lowers the codec volume level
    \param[in]  volume: a byte value from 0 to 255 (refer to codec registers 
                description for more details)
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_volume_ctrl(uint8_t volume)
{
    uint32_t counter = 0;

    if (volume > 0xE6) {
        /* set the master volume */
        counter += codec_write_register(0x20, volume - 0xE7);
        counter += codec_write_register(0x21, volume - 0xE7);
    } else {
        /* set the master volume */
        counter += codec_write_register(0x20, volume + 0x19);
        counter += codec_write_register(0x21, volume + 0x19);
    }

    return counter;
}

/*!
    \brief      enables or disables the mute feature on the audio codec
    \param[in]  cmd: AUDIO_MUTE_ON to enable the mute or AUDIO_MUTE_OFF to disable the
                mute mode
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_mute(uint32_t cmd)
{
    uint32_t counter = 0;

    /* set the mute mode */
    if (cmd == AUDIO_MUTE_ON)
    {
        counter += codec_write_register(0x04, 0xFF);
    } else {
        counter += codec_write_register(0x04, output_dev);
    }

    return counter;
}

/*!
    \brief      resets the audio codec. it restores the default configuration of the 
                codec (this function shall be called before initializing the codec)
    \note       this function calls an external driver function: The IO Expander driver
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
static void codec_reset(void)
{
    /* no operation */
}

/*!
    \brief      switch dynamically (while audio file is played) the output target (speaker or headphone)
    \note       this function modifies a global variable of the audio codec driver: output_dev.
    \param[in]  none
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
uint32_t codec_switch_output(uint8_t output)
{
    uint8_t counter = 0;

    switch (output) {
    case OUTPUT_DEVICE_SPEAKER:
        counter += codec_write_register(0x04, 0xFA); /* SPK always ON & HP always OFF */
        output_dev = 0xFA;
        break;
    case OUTPUT_DEVICE_HEADPHONE:
        counter += codec_write_register(0x04, 0xAF); /* SPK always OFF & HP always ON */
        output_dev = 0xAF;
        break;
    case OUTPUT_DEVICE_BOTH:
        counter += codec_write_register(0x04, 0xAA); /* SPK always ON & HP always ON */
        output_dev = 0xAA;
        break;
    case OUTPUT_DEVICE_AUTO:
        counter += codec_write_register(0x04, 0x05); /* detect the HP or the SPK automatically */
        output_dev = 0x05;
        break;
    default:
        counter += codec_write_register(0x04, 0x05); /* detect the HP or the SPK automatically */
        output_dev = 0x05;
        break;
    }

    return counter;
}

/*!
    \brief      writes a byte to a given register into the audio codec through the control interface
    \param[in]  register_addr: the address (location) of the register to be written
    \param[in]  register_value: the byte value to be written into destination register
    \param[out] none
    \retval     0 if correct communication, else wrong communication
*/
static uint32_t codec_write_register(uint32_t RegisterAddr, uint32_t RegisterValue)
{
    uint32_t result = 0;

    /* return the verifying value: 0 (passed) or 1 (failed) */
    return result;
}

#ifdef VERIFY_WRITTENDATA

/*!
    \brief      reads and returns te value of an audio codec register through the 
                control interface (I2C)
    \param[in]  register_addr: address of the register to be read
    \param[out] none
    \retval     value of the register to be read or dummy value if the communication fails
*/
static uint32_t codec_read_register(uint32_t RegisterAddr)
{
    uint32_t result = 0;

    /* return the byte read from codec */
    return result;
}

#endif /* VERIFY_WRITTENDATA */

/*!
    \brief      initializes the Audio Codec control interface (I2C)
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_ctrl_interface_init(void)
{
    /* no operation */
}

/*!
    \brief      restore the audio codec control interface to its default state.
                this function doesn't de-initialize the i2c because the i2c peripheral
                may be used by other modules
    \param[in]  none
    \param[out] none
    \retval     none
*/
static void codec_ctrl_interface_deinit(void)
{
    /* no operation */
}

/*!
    \brief      initializes the audio codec audio interface (i2s)
    \note       this function assumes that the i2s input clock (through pll_r in 
                devices reva/z and through dedicated plli2s_r in devices revb/y)
                is already configured and ready to be used
    \param[in]  audio_freq: audio frequency to be configured for the i2s peripheral
    \param[out] none
    \retval     none
*/
static void codec_audio_interface_init(uint32_t audio_freq)
{
    i2s_audiofreq = audio_freq;
    
